* DONE benchmark
  - [X] time
    time v8 re2_parse.js >/dev/null
    real	0m0.115s
    user	0m0.101s

    time v8 parser_parse.js >/dev/null
    real	0m0.253s
    user	0m0.236s

  - [X] space
    re2_parse 88k
    parser   188k

  - [X] feature
        - parser interface is clean, very flexible
          it take part of matcher to response to event
        - re2_parse's method is straight forward, can be apply to
          html/js ...

* DONE implement fast css minify based on re2c method [4/4]
  SCHEDULED: <2011-11-12 Sat 05:15>
  CLOCK: [2011-11-12 Sat 07:58]--[2011-11-12 Sat 08:03] =>  0:05
  :PROPERTIES:
  :Effort:   2:30
  :Clockhistory: 2
  | :Clock1: | [2011-11-12 Sat 05:17]--[2011-11-12 Sat 07:57] =>  2:40 | init     |  160 |
  | :Clock2: | [2011-11-12 Sat 07:58]--[2011-11-12 Sat 08:03] =>  0:05 | compress |    5 |
  |          |                                                         |          | 2.75 |
  #+TBLFM: $4='(convert-time-to-minutes $2)::@3$4=vsum(@1..@2)/60;%.2f
  :Commit:   (git-link "~/local/src/re2c_hw_bench" "36dae16bfe796c77f86964ef2133f8d4386fd07a")
  :END:

  - [X] text field can be compressed
        - all space
        - only :;
        - only {} ()
  - [X] regex to remove whitespace
        - is possible to compile regex into gotos
        - re2
  - [X] test
  - [X] compress script itself
* compare yui css compressor
  http://developer.yahoo.com/yui/compressor/
  - yui can remove empty rule
  - yui can do like 0.9 -> .9
  - for css spirit lots of images
    |----------+----------+-----------|
    |          | my       | yui       |
    |----------+----------+-----------|
    | time     | 0m0.236s | 0m12.790s |
    | space    | 33k      | 851k      |
    | language | js       | java      |
    | loc      | 2k       | ?         |
    |----------+----------+-----------|

